src/test.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CancelLoad xmlns="http://peletop.co.il/">
      <query>
        <ProductId>int</ProductId>
        <SumToCancel>float</SumToCancel>
        <RowForCancel>xmlxml</RowForCancel>
        <CancelInPeletalk>boolean</CancelInPeletalk>
      </query>
    </CancelLoad>
  </soap:Body>
</soap:Envelope>